# CannotCreateSideStringer Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotCreateSideStringer Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't create one or more Side Stringers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateSideStringer { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateSideStringer As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateSideStringer {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace